damBreak_laminar/damBreak/0/alpha.water.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
	{
		type	fixedValue;
		value	uniform 1;
	}
    	inletWall
	{
		type	zeroGradient;
	}
    	bottleWall
	{
		type	zeroGradient;
	}
    	atmosphere
	{
		type            inletOutlet;
        	inletValue      uniform 0;
        	value           uniform 0;
	}
	frontAndBack
	{
		type	empty;
	}
    }
}

// ************************************************************************* //
