damBreak_laminar/damBreak/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          10;
        startFace       18095;
    }
    inletWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          30;
        startFace       18105;
    }
    bottleWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          290;
        startFace       18135;
    }
    atmosphere
    {
        type            patch;
        nFaces          80;
        startFace       18425;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          18300;
        startFace       18505;
    }
)

// ************************************************************************* //
