damBreak_laminar/damBreak/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water air);

water
{
	transportModel Newtonian;
	nu	nu [0 2 -1 0 0 0 0] 1e-06;
	rho	rho [1 -3 0 0 0 0 0] 1000;
	CrossPowerLawCoeffs
	{
	nu0	nu0 [0 2 -1 0 0 0 0] 1e-06;
	nuInf	nuInf [0 2 -1 0 0 0 0] 1e-06;
	m	m [0 0 1 0 0 0 0] 1;
	n	n [0 0 0 0 0 0 0] 0;
	}
	BirdCarreauCoeffs
	{
	nu0	nu0 [0 2 -1 0 0 0 0] 0.0142515;
	nuInf	nuInf [0 2 -1 0 0 0 0] 1e-06;
	k	k [0 0 1 0 0 0 0] 99.6;
	n	n [0 0 0 0 0 0 0] 0.1003;
	}

}

air
{
	transportModel Newtonian;
	nu	nu [0 2 -1 0 0 0 0] 1.48e-05;
	rho	rho [1 -3 0 0 0 0 0] 1;
	CrossPowerLawCoeffs
	{
	nu0	nu0 [0 2 -1 0 0 0 0] 1e-06;
	nuInf	nuInf [0 2 -1 0 0 0 0] 1e-06;
	m	m [0 0 1 0 0 0 0] 1;
	n	n [0 0 0 0 0 0 0] 0;
	}
	BirdCarreauCoeffs
	{
	nu0	nu0 [0 2 -1 0 0 0 0] 0.0142515;
	nuInf	nuInf [0 2 -1 0 0 0 0] 1e-06;
	k	k [0 0 1 0 0 0 0] 99.6;
	n	n [0 0 0 0 0 0 0] 0.1003;
	}
}

sigma            sigma [1 0 -2 0 0 0 0] 0.07;

// ************************************************************************* //
